Immrcorn/ESP32S3_Baby_Monitor/app_httpd.cpp
  if (!audioBurstActive) {
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
  }

  httpd_resp_set_type(req, "application/octet-stream");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Access-Control-Expose-Headers",
                     "X-Audio-Sample-Rate, X-Audio-Channels, X-Audio-Format");
  httpd_resp_set_hdr(req, "X-Audio-Sample-Rate", "16000");
  httpd_resp_set_hdr(req, "X-Audio-Channels", "1");
  httpd_resp_set_hdr(req, "X-Audio-Format", "pcm_s16le");

  int16_t streamChunk[CHUNK_SAMPLES];
  while (audioBurstActive && millis() < burstEndTime) {
    size_t chunkBytes = 0;
    if (audioRingPop(streamChunk, &chunkBytes)) {
      if (httpd_resp_send_chunk(req, (const char *)streamChunk, chunkBytes) !=
          ESP_OK) {
        break;
      }
    } else {
      vTaskDelay(pdMS_TO_TICKS(1));
    }
  }

  httpd_resp_send_chunk(req, NULL, 0);
  return ESP_OK;
}

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  return httpd_resp_send(req, (const char *)dashboard_html_gz,
                         dashboard_html_gz_len);
}

static esp_err_t legacy_index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz,
                             index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz,
                             index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz,
                             index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

void startCameraServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 16;

  httpd_uri_t index_uri = {.uri = "/",
                           .method = HTTP_GET,
                           .handler = index_handler,
                           .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                           ,
                           .is_websocket = true,
                           .handle_ws_control_frames = false,
                           .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t legacy_index_uri = {.uri = "/legacy",
                                  .method = HTTP_GET,
                                  .handler = legacy_index_handler,
                                  .user_ctx = NULL};

  httpd_uri_t status_uri = {.uri = "/status",
                            .method = HTTP_GET,
                            .handler = status_handler,
                            .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                            ,
                            .is_websocket = true,
                            .handle_ws_control_frames = false,
                            .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cmd_uri = {.uri = "/control",
                         .method = HTTP_GET,
                         .handler = cmd_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t capture_uri = {.uri = "/capture",
                             .method = HTTP_GET,
                             .handler = capture_handler,
                             .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                             ,
                             .is_websocket = true,
                             .handle_ws_control_frames = false,
                             .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t stream_uri = {.uri = "/stream",
                            .method = HTTP_GET,
                            .handler = stream_handler,
                            .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                            ,
                            .is_websocket = true,
                            .handle_ws_control_frames = false,
                            .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t bmp_uri = {.uri = "/bmp",
                         .method = HTTP_GET,
                         .handler = bmp_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t xclk_uri = {.uri = "/xclk",
                          .method = HTTP_GET,
                          .handler = xclk_handler,
                          .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                          ,
                          .is_websocket = true,
                          .handle_ws_control_frames = false,
                          .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t reg_uri = {.uri = "/reg",
                         .method = HTTP_GET,
                         .handler = reg_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t greg_uri = {.uri = "/greg",
                          .method = HTTP_GET,
                          .handler = greg_handler,
                          .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                          ,
                          .is_websocket = true,
                          .handle_ws_control_frames = false,
                          .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t pll_uri = {.uri = "/pll",
                         .method = HTTP_GET,
                         .handler = pll_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

