Immrcorn/ESP32S3_Baby_Monitor/app_httpd.cpp
  httpd_uri_t win_uri = {.uri = "/resolution",
                         .method = HTTP_GET,
                         .handler = win_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t level_uri = {.uri = "/level",
                           .method = HTTP_GET,
                           .handler = level_handler,
                           .user_ctx = NULL};

  httpd_uri_t set_threshold_uri = {.uri = "/set",
                                   .method = HTTP_GET,
                                   .handler = set_threshold_handler,
                                   .user_ctx = NULL};

  httpd_uri_t audio_uri = {.uri = "/audio",
                           .method = HTTP_GET,
                           .handler = audio_handler,
                           .user_ctx = NULL};

  ra_filter_init(&ra_filter, 20);

  // ======================= BABY MONITOR AUDIO INIT =====================
  prefs.begin("babymonitor", false);
  if (prefs.getType("threshold") == PT_I32) {
    threshold = (float)prefs.getInt("threshold", 3);
    prefs.putFloat("threshold", threshold);
  } else {
    threshold = prefs.getFloat("threshold", 3.0f);
  }
  if (!isfinite(threshold) || threshold < 0.1f || threshold > 95.0f) {
    threshold = 3.0f;
  }
  audioGain = prefs.getFloat("gain", 4.0f);
  if (!isfinite(audioGain) || audioGain < 1.0f || audioGain > 16.0f) {
    audioGain = 4.0f;
  }
  log_i("[AUDIO] Loaded threshold = %.1f", threshold);
  Serial.printf("[AUDIO] Loaded threshold = %.1f, gain = %.0f\n", threshold,
                audioGain);

  I2S.setPinsPdmRx(42, 41);
  if (!I2S.begin(I2S_MODE_PDM_RX, SAMPLE_RATE, I2S_DATA_BIT_WIDTH_16BIT,
                 I2S_SLOT_MODE_MONO)) {
    audioOk = false;
    log_e("[AUDIO] I2S microphone initialization FAILED");
    Serial.println("[AUDIO] I2S microphone initialization FAILED");
  } else {
    audioOk = true;
    log_i("[AUDIO] I2S microphone ready on GPIOs 42/41");
    Serial.println("[AUDIO] I2S microphone ready on GPIOs 42/41");
    xTaskCreatePinnedToCore(audioLevelTask, "audioLevelTask", 4096, NULL, 5,
                            NULL, 1);
  }
// ========================================================================
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
  recognizer.set_partition(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY,
                           "fr");

  // load ids from flash partition
  recognizer.set_ids_from_flash();
#endif
  log_i("Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &legacy_index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);

    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);
    httpd_register_uri_handler(camera_httpd, &level_uri);
    httpd_register_uri_handler(camera_httpd, &set_threshold_uri);
    httpd_register_uri_handler(camera_httpd, &audio_uri);
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
}

void setupLedFlash(int pin) {
#if CONFIG_LED_ILLUMINATOR_ENABLED
  ledcAttach(pin, 5000, 8);
#else
  log_i("LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0");
#endif
}
